{
  "title": "Lanzamiento de la última versión de Python, ¿Qué novedades nos trae Python 4.0?",
  "author": "Justino Ramírez Ortegón",
  "createdAt": "Mar 31 de oct 2023",
  "body": "El final del culebrón que ha acaparado la atención en la industria global de los semiconductores durante los últimos dos meses ha sido el esperado. Como vaticinaron los expertos de la plataforma de comunicación canadiense TechInsights a principios del pasado mes de septiembre, el SoC Kirin 9000S integrado en el smartphone Mate 60 Pro de Huawei ha sido fabricado por SMIC empleando los equipos de litografía de ultravioleta profundo (UVP) de ASML que tiene en su poder. \n\n Casi dos meses después de aquella catarsis existe un acuerdo generalizado entre los expertos en la fabricación de circuitos integrados que defiende que los ingenieros de SMIC han utilizado los equipos de litografía UVP TwinScan NXT:2000i de ASML y también herramientas diseñadas por Huawei. Aunque no son tan avanzadas como las máquinas de litografía de ultravioleta extremo (UVE), los equipos UVP se pueden emplear para producir chips de 7 y 5 nm siempre y cuando el proceso de fabricación sea lo suficientemente refinado. \n\n Uno de los expertos que defiende esta posibilidad es Burn-Jeng Lin, y no es un técnico cualquiera. Este ingeniero eléctrico ha sido vicepresidente en TSMC, por lo que es evidente que sabe de lo que habla. Durante una entrevista muy reciente que ha concedido a Bloomberg Lin ha asegurado que EEUU no va a poder hacer nada para evitar con garantías que China continúe mejorando su tecnología de fabricación de semiconductores. De hecho, es probable que a medio plazo SMIC sea capaz de fabricar chips de 5 nm utilizando sus equipos TwinScan NXT:2000i. \n\n# El gran desafío de China es ir más allá de los 5 nm \n\n A principios de septiembre los técnicos de TechInsights vaticinaron que si los ingenieros de SMIC habían logrado refinar lo suficiente su tecnología de integración para fabricar chips de 7 nm con los equipos UVP de ASML los 5 nm también llegarían. Una de las dudas que estaban en ese momento sobre la mesa arrojaba incertidumbre sobre el rendimiento por oblea que presumiblemente había alcanzado SMIC, pero, al parecer, es lo suficientemente alto para permitir a Huawei comercializar 70 millones de terminales Mate 60 Pro. \n\n En cualquier caso, fabricar circuitos integrados de 5 nm es más complejo que producir chips de 7 nm. Sobre el papel los equipos TwinScan NXT:2000i permiten hacerlo, pero es muy probable que los ingenieros de SMIC se vean obligados a recurrir a una técnica de litografía conocida como multiple patterning, que, a grandes rasgos, consiste en transferir el patrón a la oblea en varias pasadas con el propósito de incrementar la resolución del proceso litográfico. Es muy probable que los ingenieros de SMIC ya hayan utilizado esta técnica para fabricar el chip Kirin 9000S, pero cabe la posibilidad de que para llegar a los 5 nm tengan que utilizar un multi-patterning aún más sofisticado con hasta tres o cuatro pasadas. \n\n Probablemente ningún experto se sorprenderá si dentro de unos meses un nuevo teléfono móvil de Huawei incorpora un SoC de 5 nm fabricado por SMIC. Sin embargo, ir más allá de esta litografía empleando los equipos UVP de ASML va a ser extremadamente difícil. De hecho, es probable que no sea viable. Las sanciones de EEUU evitan que lleguen a China más equipos TwinScan NXT:2000i, y a partir del 16 de noviembre el país liderado por Xi Jinping tampoco recibirá equipos TwinScan NXT:1980Di. En estas circunstancias China solo tiene una salida: diseñar y fabricar sus propias máquinas de litografía de ultravioleta extremo. Está en ello, pero es poco probable que las tenga antes de que acabe esta década.\n\n"
}
