[
  "El cero no es ni positivo ni negativo: El cero es el único número que no es ni positivo ni negativo.",
  "El infinito no es un número: El infinito (∞) es un concepto, no un número específico.",
  "Números primos: Los números primos solo tienen dos factores: 1 y ellos mismos.",
  "Números perfectos: Un número perfecto es igual a la suma de sus divisores propios (ejemplo: 6 = 1 + 2 + 3).",
  "Pi (π): Pi es la relación entre la circunferencia de un círculo y su diámetro, y es aproximadamente 3.14159.",
  "La razón áurea: La razón áurea (φ) es aproximadamente 1.618 y se encuentra en diversos patrones naturales.",
  "Secuencia de Fibonacci: Cada número en la secuencia de Fibonacci es la suma de los dos anteriores (ejemplo: 0, 1, 1, 2, 3, 5, 8...).",
  "El número de Euler (e): El número de Euler (e) es aproximadamente 2.71828 y es importante en cálculo y crecimiento exponencial.",
  "El número de Graham: El número de Graham es un número enorme utilizado en matemáticas teóricas.",
  "Números complejos: Los números complejos tienen una parte real y una parte imaginaria (ejemplo: i = √(-1)).",
  "Teorema de Pitágoras: En un triángulo rectángulo, el cuadrado de la hipotenusa es igual a la suma de los cuadrados de los otros dos lados (a² + b² = c²).",
  "Área de un círculo: El área de un círculo es πr², donde r es el radio.",
  "Volumen de una esfera: El volumen de una esfera es (4/3)πr³, donde r es el radio.",
  "Tipos de ángulos: Agudo (menos de 90°), Recto (exactamente 90°), Obtuso (más de 90° pero menos de 180°), Recto (exactamente 180°), Reflexivo (más de 180°).",
  "Polígonos: Figuras con varios lados; triángulos (3 lados), cuadriláteros (4 lados), pentágonos (5 lados), hexágonos (6 lados), etc.",
  "Simetría: Los objetos que son iguales en ambos lados tienen simetría.",
  "Fractales: Patrones geométricos que se repiten a diferentes escalas.",
  "Sólidos Platónicos: Poliedros regulares con caras idénticas.",
  "Transformaciones geométricas: Traducción, rotación, reflexión y dilatación son transformaciones comunes.",
  "Orden de operaciones (PEMDAS): Paréntesis, Exponentes, Multiplicación y División (de izquierda a derecha), Adición y Sustracción (de izquierda a derecha).",
  "Trucos de multiplicación: Por ejemplo, multiplicar por 9 usando el método de los dedos o utilizando la propiedad distributiva.",
  "Reglas de divisibilidad: Reglas para determinar si un número es divisible por otro (por ejemplo, divisibilidad por 2, 3, 4, 5, 6, 9, 10).",
  "Números binarios: Sistema numérico en base 2 utilizado en computadoras (0s y 1s).",
  "Números romanos: Sistema numeral antiguo que usa letras (I, V, X, L, C, D, M) para representar números.",
  "Conceptos básicos de probabilidad: La probabilidad de que ocurra un evento, a menudo expresada como una fracción o porcentaje.",
  "Ecuaciones lineales: Ecuaciones de la forma y = mx + b, donde m es la pendiente y b es la intersección en y.",
  "Ecuaciones cuadráticas: Ecuaciones de la forma ax² + bx + c = 0, a menudo resueltas utilizando la fórmula cuadrática.",
  "Cuadrados mágicos: Cuadrículas donde la suma de cada fila, columna y diagonal es la misma.",
  "Algoritmos del Cubo de Rubik: Combinaciones usadas para resolver el Cubo de Rubik.",
  "Cinta de Möbius: Una superficie con un solo lado y un solo límite.",
  "Teselaciones: Patrones hechos de formas idénticas que encajan sin dejar huecos.",
  "Juegos matemáticos: Ajedrez, Sudoku y otros juegos con estrategias matemáticas.",
  "Pitágoras: Matemático griego conocido por el teorema de Pitágoras.",
  "Arquímedes: Calculó π e inventó muchos conceptos matemáticos.",
  "Euclides: Conocido como el 'Padre de la Geometría' por su trabajo en principios geométricos.",
  "René Descartes: Desarrolló el sistema de coordenadas cartesianas.",
  "Leonhard Euler: Pionero en teoría de grafos, cálculo y teoría de números.",
  "Alan Turing: Padre de la informática teórica e inteligencia artificial.",
  "Ley de Benford: La distribución de la frecuencia de los dígitos en muchos conjuntos de datos numéricos sigue un patrón específico.",
  "Triángulo de Pascal: Una matriz triangular de números donde cada número es la suma de los dos números directamente arriba de él.",
  "Problema de Monty Hall: Un rompecabezas de probabilidad basado en un escenario de programa de concursos.",
  "Distribución gaussiana: Una curva en forma de campana usada para describir muchos fenómenos naturales.",
  "Transitividad: Si a = b y b = c, entonces a = c.",
  "Asociatividad: (a + b) + c = a + (b + c).",
  "Conmutatividad: a + b = b + a.",
  "Identidad: a + 0 = a y a × 1 = a.",
  "Inversa: a + (-a) = 0 y a × (1/a) = 1 (para a ≠ 0).",
  "Geometría fractal en la naturaleza: Ejemplos de patrones fractales en árboles, nubes y costas.",
  "Secuencia de Fibonacci en las plantas: Patrones en la disposición de hojas, semillas y pétalos.",
  "Simetría en los copos de nieve: Cada copo de nieve tiene un patrón simétrico único.",
  "Proporción áurea en la arquitectura: Edificaciones y estructuras diseñadas con proporciones cercanas a la proporción áurea.",
  "Pi y círculos en la naturaleza: La relación entre formas circulares y fenómenos naturales.",
  "E = mc²: La ecuación de Einstein que relaciona energía y masa.",
  "Ley de la gravitación universal de Newton: F = G (m₁m₂/r²), describe la fuerza de atracción entre dos masas.",
  "Ecuaciones de Maxwell: Ecuaciones fundamentales del electromagnetismo.",
  "Ecuación de Schrödinger: Describe cómo cambia el estado cuántico de un sistema físico con el tiempo.",
  "Ecuación de Black-Scholes: Se utiliza en matemáticas financieras para modelar el precio de derivados.",
  "Problemas de tablero de ajedrez: Recorrido del caballo, el rompecabezas de las ocho reinas, etc.",
  "Rompecabezas de lógica: Problemas de cruce de ríos, puzzles de mentiroso y veraz, etc.",
  "Variaciones de Sudoku: Diferentes tipos de puzzles de Sudoku (por ejemplo, irregulares, diagonales, etc.).",
  "Adivinanzas matemáticas: Acertijos y rompecabezas basados en matemáticas.",
  "Matemáticas en el arte: Uso de conceptos matemáticos en pinturas, esculturas y arquitectura.",
  "Música matemática: Relaciones entre matemáticas y teoría musical.",
  "Matemáticas en la literatura: Referencias a conceptos matemáticos en poemas, novelas y obras de teatro.",
  "Computación cuántica: Aplicaciones teóricas y prácticas de las matemáticas cuánticas.",
  "Aprendizaje automático y matemáticas: El papel de las matemáticas en el desarrollo de algoritmos e inteligencia artificial.",
  "Criptomonedas y Blockchain: Los principios matemáticos detrás de las criptomonedas como Bitcoin.",
  "Big Data y matemáticas: Manejo de grandes conjuntos de datos utilizando técnicas matemáticas.",
  "Importancia de la educación matemática temprana: Construir una base sólida para habilidades matemáticas futuras.",
  "Ansiedad matemática: Abordando los temores y desafíos asociados con el aprendizaje de las matemáticas.",
  "Métodos de enseñanza innovadores: Uso de la tecnología y enfoques interactivos para enseñar matemáticas.",
  "Competencias matemáticas: Olimpiadas, torneos de matemáticas y otras competiciones para promover la excelencia matemática.",
  "\"No te preocupes por tus dificultades en Matemáticas. Te aseguro que las mías son aún mayores.\" – Albert Einstein",
  "\"Las matemáticas, vistas correctamente, poseen no solo la verdad, sino una belleza suprema.\" – Bertrand Russell",
  "\"La única forma de aprender matemáticas es hacer matemáticas.\" – Paul Halmos",
  "Chistes matemáticos: Chistes y juegos de palabras relacionados con las matemáticas.",
  "Arte matemático: Creaciones artísticas basadas en conceptos matemáticos.",
  "Matemáticas y filosofía: Intersecciones entre las matemáticas y el pensamiento filosófico.",
  "Software matemático: Herramientas como Mathematica, MATLAB y Desmos para la exploración matemática.",
  "Descubrimientos matemáticos: Avances recientes en el campo de las matemáticas.",
  "Problemas abiertos en matemáticas: Preguntas no resueltas y conjeturas matemáticas.",
  "Matemáticas y la vida cotidiana: Cómo las matemáticas impactan las decisiones y actividades diarias."
]
